using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace enx_fit.Migrations
{
    /// <inheritdoc />
    public partial class PopulateExerciseCatalog : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.Sql("""
                INSERT INTO "Exercises" ("Id", "Equipment", "MuscleGroup", "Name", "Notes")
                VALUES
                    (-2913, 'Велосипед', 'Кардио', 'Езда на велосипеде', NULL),
                    (-2912, 'Без оборудования', 'Кардио', 'Быстрая ходьба', NULL),
                    (-2911, 'Без оборудования', 'Кардио', 'Бег на улице', NULL),
                    (-2910, 'Без оборудования', 'Кардио', 'Альпинист', NULL),
                    (-2909, 'Без оборудования', 'Кардио', 'Прыжки джампинг-джек', NULL),
                    (-2908, 'Без оборудования', 'Кардио', 'Бег на месте с высоким подниманием коленей', NULL),
                    (-2907, 'Скакалка', 'Кардио', 'Прыжки со скакалкой', NULL),
                    (-2906, 'Степпер', 'Кардио', 'Лестничный тренажёр', NULL),
                    (-2905, 'Эллиптический тренажёр', 'Кардио', 'Эллиптический тренажёр', NULL),
                    (-2904, 'Гребной тренажёр', 'Кардио', 'Гребля на тренажёре', NULL),
                    (-2903, 'Велотренажёр', 'Кардио', 'Велотренажёр', NULL),
                    (-2902, 'Беговая дорожка', 'Кардио', 'Ходьба на дорожке под наклоном', NULL),
                    (-2901, 'Беговая дорожка', 'Кардио', 'Ходьба на дорожке', NULL),
                    (-2900, 'Беговая дорожка', 'Кардио', 'Бег на дорожке', NULL),
                    (-2817, 'Мешок с песком', 'Всё тело', 'Переноска мешка с песком', NULL),
                    (-2816, 'Гири', 'Всё тело', 'Прогулка с гирями над головой', NULL),
                    (-2815, 'Силовые сани', 'Всё тело', 'Тяга силовых саней', NULL),
                    (-2814, 'Силовые сани', 'Всё тело', 'Толкание силовых саней', NULL),
                    (-2813, 'Боевые канаты', 'Всё тело', 'Удары канатами', NULL),
                    (-2812, 'Медбол', 'Всё тело', 'Бросок медбола в стену', NULL),
                    (-2811, 'Платформа', 'Всё тело', 'Бёрпи с прыжком на платформу', NULL),
                    (-2810, 'Без оборудования', 'Всё тело', 'Бёрпи', NULL),
                    (-2809, 'Гантели', 'Всё тело', 'Трастер с гантелями', NULL),
                    (-2808, 'Штанга', 'Всё тело', 'Трастер со штангой', NULL),
                    (-2807, 'Гиря', 'Всё тело', 'Толчок гири одной рукой', NULL),
                    (-2806, 'Штанга', 'Всё тело', 'Толчок штанги', NULL),
                    (-2805, 'Гиря', 'Всё тело', 'Взятие гири на грудь', NULL),
                    (-2804, 'Штанга', 'Всё тело', 'Взятие штанги на грудь', NULL),
                    (-2803, 'Штанга', 'Всё тело', 'Рывковая тяга штанги', NULL),
                    (-2802, 'Штанга, плинты', 'Всё тело', 'Тяга штанги с плинтов', NULL),
                    (-2801, 'Гиря', 'Всё тело', 'Становая тяга с гирей', NULL),
                    (-2800, 'Трэп-гриф', 'Всё тело', 'Становая тяга с трэп-грифом', NULL),
                    (-2704, 'Без оборудования', 'Шея', 'Изометрическое разгибание шеи с сопротивлением ладони', NULL),
                    (-2703, 'Без оборудования', 'Шея', 'Изометрическое сгибание шеи с сопротивлением ладони', NULL),
                    (-2702, 'Без оборудования', 'Шея', 'Боковое сгибание шеи лёжа', NULL),
                    (-2701, 'Без оборудования', 'Шея', 'Разгибание шеи лёжа', NULL),
                    (-2700, 'Без оборудования', 'Шея', 'Сгибание шеи лёжа', NULL),
                    (-2611, 'Фитбол', 'Мышцы кора', 'Планка на фитболе', NULL),
                    (-2610, 'Гиря', 'Мышцы кора', 'Турецкий подъём', NULL),
                    (-2609, 'Гантель или гиря', 'Мышцы кора', 'Чемоданная прогулка', NULL),
                    (-2608, 'Гиря', 'Мышцы кора', 'Удержание гири над головой одной рукой', NULL),
                    (-2607, 'Без оборудования', 'Мышцы кора', 'Полый корпус', NULL),
                    (-2606, 'Без оборудования', 'Мышцы кора', 'Медвежья ходьба', NULL),
                    (-2605, 'Без оборудования', 'Мышцы кора', 'Медвежья планка', NULL),
                    (-2604, 'Гантель', 'Мышцы кора', 'Планка с перетаскиванием гантели', NULL),
                    (-2603, 'Без оборудования', 'Мышцы кора', 'Планка с подъёмом ноги', NULL),
                    (-2602, 'Без оборудования', 'Мышцы кора', 'Планка с касанием плеч', NULL),
                    (-2601, 'Без оборудования', 'Мышцы кора', 'Планка на прямых руках', NULL),
                    (-2600, 'Без оборудования', 'Мышцы кора', 'Планка на предплечьях', NULL),
                    (-2506, 'Без оборудования', 'Отводящие мышцы бедра', 'Боковые выпады с собственным весом', NULL),
                    (-2505, 'Без оборудования', 'Отводящие мышцы бедра', 'Подъём ноги лёжа на боку', NULL),
                    (-2504, 'Резиновая петля', 'Отводящие мышцы бедра', 'Ракушка с резиновой петлёй', NULL),
                    (-2503, 'Резиновая петля', 'Отводящие мышцы бедра', 'Боковые шаги с резиновой петлёй', NULL),
                    (-2502, 'Резиновая петля', 'Отводящие мышцы бедра', 'Отведение ноги с резиновой петлёй', NULL),
                    (-2501, 'Кроссовер', 'Отводящие мышцы бедра', 'Отведение ноги в кроссовере', NULL),
                    (-2500, 'Тренажёр', 'Отводящие мышцы бедра', 'Разведение ног в тренажёре', NULL),
                    (-2406, 'Штанга', 'Приводящие мышцы бедра', 'Сумо-приседания со штангой', NULL),
                    (-2405, 'Скамья', 'Приводящие мышцы бедра', 'Копенгагенская планка', NULL),
                    (-2404, 'Без оборудования', 'Приводящие мышцы бедра', 'Казачьи приседания', NULL),
                    (-2403, 'Гантели', 'Приводящие мышцы бедра', 'Боковые выпады с гантелями', NULL),
                    (-2402, 'Резиновая петля', 'Приводящие мышцы бедра', 'Приведение ноги с резиновой петлёй', NULL),
                    (-2401, 'Кроссовер', 'Приводящие мышцы бедра', 'Приведение ноги в кроссовере', NULL),
                    (-2400, 'Тренажёр', 'Приводящие мышцы бедра', 'Сведение ног в тренажёре', NULL),
                    (-2307, 'Гантели, скамья', 'Трапеции', 'Y-подъёмы лёжа на наклонной скамье', NULL),
                    (-2306, 'Гантели, скамья', 'Трапеции', 'Тяга гантелей лёжа на скамье на средние трапеции', NULL),
                    (-2305, 'Трэп-гриф', 'Трапеции', 'Шраги с трэп-грифом', NULL),
                    (-2304, 'Блочный тренажёр', 'Трапеции', 'Шраги на нижнем блоке', NULL),
                    (-2303, 'Гири', 'Трапеции', 'Шраги с гирями', NULL),
                    (-2302, 'Тренажёр Смита', 'Трапеции', 'Шраги в Смите', NULL),
                    (-2301, 'Гантели', 'Трапеции', 'Шраги с гантелями', NULL),
                    (-2300, 'Штанга', 'Трапеции', 'Шраги со штангой', NULL),
                    (-2207, 'Скамья для гиперэкстензии', 'Поясница', 'Изометрическое удержание корпуса в гиперэкстензии', NULL),
                    (-2206, 'Штанга', 'Поясница', 'Наклоны со штангой на плечах', NULL),
                    (-2205, 'Без оборудования', 'Поясница', 'Птица-собака', NULL),
                    (-2204, 'Без оборудования', 'Поясница', 'Супермен', NULL),
                    (-2203, 'Тренажёр GHD', 'Поясница', 'Разгибание спины на тренажёре GHD', NULL),
                    (-2202, 'Скамья или тренажёр', 'Поясница', 'Обратная гиперэкстензия', NULL),
                    (-2201, 'Скамья для гиперэкстензии, блин', 'Поясница', 'Гиперэкстензия с отягощением', NULL),
                    (-2200, 'Скамья для гиперэкстензии', 'Поясница', 'Гиперэкстензия', NULL),
                    (-2111, 'Турник', 'Косые мышцы живота', 'Подъём коленей к локтям в висе', NULL),
                    (-2110, 'Гантель', 'Косые мышцы живота', 'Наклоны в сторону с гантелью', NULL),
                    (-2109, 'Эспандер', 'Косые мышцы живота', 'Паллоф-пресс с эспандером', NULL),
                    (-2108, 'Кроссовер', 'Косые мышцы живота', 'Паллоф-пресс', NULL),
                    (-2107, 'Кроссовер', 'Косые мышцы живота', 'Дровосек на нижнем блоке', NULL),
                    (-2106, 'Кроссовер', 'Косые мышцы живота', 'Дровосек на верхнем блоке', NULL),
                    (-2105, 'Кроссовер', 'Косые мышцы живота', 'Повороты корпуса в кроссовере', NULL),
                    (-2104, 'Без оборудования', 'Косые мышцы живота', 'Косые скручивания лёжа', NULL),
                    (-2103, 'Медбол', 'Косые мышцы живота', 'Русские повороты с мячом', NULL),
                    (-2102, 'Без оборудования', 'Косые мышцы живота', 'Русские повороты', NULL),
                    (-2101, 'Без оборудования', 'Косые мышцы живота', 'Боковая планка с подъёмом таза', NULL),
                    (-2100, 'Без оборудования', 'Косые мышцы живота', 'Боковая планка', NULL),
                    (-2017, 'Без оборудования', 'Пресс', 'Мёртвый жук', NULL),
                    (-2016, 'Брусья', 'Пресс', 'Уголок в упоре', NULL),
                    (-2015, 'Штанга', 'Пресс', 'Выкатывание штанги', NULL),
                    (-2014, 'Ролик для пресса', 'Пресс', 'Выкатывание ролика стоя', NULL),
                    (-2013, 'Ролик для пресса', 'Пресс', 'Выкатывание ролика с колен', NULL),
                    (-2012, 'Без оборудования', 'Пресс', 'Велосипедные скручивания', NULL),
                    (-2011, 'Без оборудования', 'Пресс', 'V-складка', NULL),
                    (-2010, 'Без оборудования', 'Пресс', 'Складка сидя', NULL),
                    (-2009, 'Наклонная скамья', 'Пресс', 'Подъём ног на наклонной скамье', NULL),
                    (-2008, 'Без оборудования', 'Пресс', 'Подъём ног лёжа', NULL),
                    (-2007, 'Стойка для пресса', 'Пресс', 'Подъём коленей в упоре', NULL),
                    (-2006, 'Турник', 'Пресс', 'Подъём прямых ног в висе', NULL),
                    (-2005, 'Турник', 'Пресс', 'Подъём коленей в висе', NULL),
                    (-2004, 'Без оборудования', 'Пресс', 'Обратные скручивания', NULL),
                    (-2003, 'Тренажёр', 'Пресс', 'Скручивания в тренажёре', NULL),
                    (-2002, 'Блочный тренажёр', 'Пресс', 'Скручивания на верхнем блоке', NULL),
                    (-2001, 'Блин', 'Пресс', 'Скручивания с блином', NULL),
                    (-2000, 'Без оборудования', 'Пресс', 'Скручивания лёжа', NULL),
                    (-1909, 'Гантели', 'Икры', 'Ходьба на носках с гантелями', NULL),
                    (-1908, 'Гантель', 'Икры', 'Подъём носков сидя с отягощением', NULL),
                    (-1907, 'Без оборудования', 'Икры', 'Подъём носков стоя у стены', NULL),
                    (-1906, 'Тренажёр или партнёр', 'Икры', 'Ослиные подъёмы на носки', NULL),
                    (-1905, 'Опора', 'Икры', 'Подъём на носок одной ноги', NULL),
                    (-1904, 'Гантели', 'Икры', 'Подъём на носки с гантелями', NULL),
                    (-1903, 'Тренажёр Смита', 'Икры', 'Подъём на носки в Смите', NULL),
                    (-1902, 'Тренажёр для жима ногами', 'Икры', 'Подъём на носки в жиме ногами', NULL),
                    (-1901, 'Тренажёр', 'Икры', 'Подъём на носки сидя в тренажёре', NULL),
                    (-1900, 'Тренажёр', 'Икры', 'Подъём на носки стоя в тренажёре', NULL),
                    (-1817, 'Резиновая петля', 'Ягодицы', 'Шаги в полуприседе с резиновой петлёй', NULL),
                    (-1816, 'Без оборудования', 'Ягодицы', 'Лягушачьи мостики', NULL),
                    (-1815, 'Скамья для гиперэкстензии', 'Ягодицы', 'Гиперэкстензия с акцентом на ягодицы', NULL),
                    (-1814, 'Платформа, гантели', 'Ягодицы', 'Подъём на платформу с акцентом на ягодицы', NULL),
                    (-1813, 'Резиновая петля', 'Ягодицы', 'Отведение ноги назад с резиновой петлёй', NULL),
                    (-1812, 'Тренажёр', 'Ягодицы', 'Отведение ноги назад в тренажёре', NULL),
                    (-1811, 'Кроссовер', 'Ягодицы', 'Отведение ноги назад в кроссовере', NULL),
                    (-1810, 'Штанга', 'Ягодицы', 'Становая тяга сумо', NULL),
                    (-1809, 'Гантель', 'Ягодицы', 'Широкие приседания сумо с гантелью', NULL),
                    (-1808, 'Гантели', 'Ягодицы', 'Диагональные выпады', NULL),
                    (-1807, 'Штанга', 'Ягодицы', 'Обратные выпады со штангой', NULL),
                    (-1806, 'Резиновая петля', 'Ягодицы', 'Ягодичный мост с резиновой петлёй', NULL),
                    (-1805, 'Тренажёр Смита, скамья', 'Ягодицы', 'Ягодичный мост в Смите', NULL),
                    (-1804, 'Тренажёр', 'Ягодицы', 'Ягодичный мост в тренажёре', NULL),
                    (-1803, 'Без оборудования', 'Ягодицы', 'Ягодичный мост на одной ноге', NULL),
                    (-1802, 'Без оборудования', 'Ягодицы', 'Ягодичный мост на полу', NULL),
                    (-1801, 'Гантель, скамья', 'Ягодицы', 'Ягодичный мост с гантелью', NULL),
                    (-1800, 'Штанга, скамья', 'Ягодицы', 'Ягодичный мост со штангой', NULL),
                    (-1714, 'Гиря', 'Задняя поверхность бедра', 'Махи гирей', NULL),
                    (-1713, 'Кроссовер', 'Задняя поверхность бедра', 'Тяга каната между ног', NULL),
                    (-1712, 'Тренажёр GHD', 'Задняя поверхность бедра', 'Подъём корпуса в тренажёре GHD', NULL),
                    (-1711, 'Фиксация голеней', 'Задняя поверхность бедра', 'Нордические сгибания', NULL),
                    (-1710, 'Скользящие диски', 'Задняя поверхность бедра', 'Сгибание ног со скользящими дисками', NULL),
                    (-1709, 'Фитбол', 'Задняя поверхность бедра', 'Сгибание ног с фитболом', NULL),
                    (-1708, 'Тренажёр', 'Задняя поверхность бедра', 'Сгибание ног стоя поочерёдно', NULL),
                    (-1707, 'Тренажёр', 'Задняя поверхность бедра', 'Сгибание ног сидя', NULL),
                    (-1706, 'Тренажёр', 'Задняя поверхность бедра', 'Сгибание ног лёжа', NULL),
                    (-1705, 'Эспандер', 'Задняя поверхность бедра', 'Доброе утро с эспандером', NULL),
                    (-1704, 'Штанга', 'Задняя поверхность бедра', 'Доброе утро со штангой', NULL),
                    (-1703, 'Гиря', 'Задняя поверхность бедра', 'Румынская тяга с гирей', NULL),
                    (-1702, 'Гантель', 'Задняя поверхность бедра', 'Румынская тяга на одной ноге с гантелью', NULL),
                    (-1701, 'Гантели', 'Задняя поверхность бедра', 'Румынская тяга с гантелями', NULL),
                    (-1700, 'Штанга', 'Задняя поверхность бедра', 'Становая тяга на прямых ногах', NULL),
                    (-1623, 'Силовые сани', 'Квадрицепсы', 'Обратная тяга саней', NULL),
                    (-1622, 'Опора', 'Квадрицепсы', 'Сисси-приседания', NULL),
                    (-1621, 'Скамья', 'Квадрицепсы', 'Приседания на одной ноге до скамьи', NULL),
                    (-1620, 'Платформа, гантели', 'Квадрицепсы', 'Зашагивания на платформу', NULL),
                    (-1619, 'Гантели', 'Квадрицепсы', 'Сплит-приседания', NULL),
                    (-1618, 'Скамья, гантели', 'Квадрицепсы', 'Болгарские сплит-приседания', NULL),
                    (-1617, 'Штанга', 'Квадрицепсы', 'Выпады со штангой', NULL),
                    (-1616, 'Гантели', 'Квадрицепсы', 'Выпады назад с гантелями', NULL),
                    (-1615, 'Гантели', 'Квадрицепсы', 'Выпады вперёд с гантелями', NULL),
                    (-1614, 'Тренажёр', 'Квадрицепсы', 'Разгибание одной ноги сидя', NULL),
                    (-1613, 'Тренажёр', 'Квадрицепсы', 'Разгибание ног сидя', NULL),
                    (-1612, 'Тренажёр для жима ногами', 'Квадрицепсы', 'Жим ногами одной ногой', NULL),
                    (-1611, 'Тренажёр для жима ногами', 'Квадрицепсы', 'Жим ногами узкой постановкой', NULL),
                    (-1610, 'Гакк-тренажёр', 'Квадрицепсы', 'Приседания в гакк-тренажёре с обратной постановкой', NULL),
                    (-1609, 'Гакк-тренажёр', 'Квадрицепсы', 'Хакк-приседания', NULL),
                    (-1608, 'Штанга', 'Квадрицепсы', 'Зерхер-приседания', NULL),
                    (-1607, 'Без оборудования', 'Квадрицепсы', 'Приседания с прыжком', NULL),
                    (-1606, 'Без оборудования', 'Квадрицепсы', 'Приседания с собственным весом', NULL),
                    (-1605, 'Гиря или гантель', 'Квадрицепсы', 'Гоблет-приседания', NULL),
                    (-1604, 'Гантели', 'Квадрицепсы', 'Приседания с гантелями', NULL),
                    (-1603, 'Штанга', 'Квадрицепсы', 'Приседания с паузой', NULL),
                    (-1602, 'Тренажёр Смита', 'Квадрицепсы', 'Приседания в Смите', NULL),
                    (-1601, 'Штанга', 'Квадрицепсы', 'Приседания со штангой на груди со скрещёнными руками', NULL),
                    (-1600, 'Штанга', 'Квадрицепсы', 'Фронтальные приседания со штангой', NULL),
                    (-1511, 'Гантели или гири', 'Предплечья', 'Фермерская прогулка', NULL),
                    (-1510, 'Кистевой эспандер', 'Предплечья', 'Сжатие кистевого эспандера', NULL),
                    (-1509, 'Роллер для предплечий', 'Предплечья', 'Наматывание веса на роллер', NULL),
                    (-1508, 'Блины', 'Предплечья', 'Удержание блинов пальцами', NULL),
                    (-1507, 'Турник, полотенца', 'Предплечья', 'Вис на полотенцах', NULL),
                    (-1506, 'Турник', 'Предплечья', 'Вис на перекладине', NULL),
                    (-1505, 'Гантель', 'Предплечья', 'Супинация предплечья с гантелью', NULL),
                    (-1504, 'Гантель', 'Предплечья', 'Пронация предплечья с гантелью', NULL),
                    (-1503, 'Гантели', 'Предплечья', 'Разгибание запястий с гантелями', NULL),
                    (-1502, 'Гантели', 'Предплечья', 'Сгибание запястий с гантелями', NULL),
                    (-1501, 'Штанга', 'Предплечья', 'Разгибание запястий со штангой', NULL),
                    (-1500, 'Штанга', 'Предплечья', 'Сгибание запястий со штангой', NULL),
                    (-1417, 'Эспандер', 'Трицепс', 'Разгибание рук с эспандером', NULL),
                    (-1416, 'Гантели, скамья', 'Трицепс', 'Жим Тейта', NULL),
                    (-1415, 'Тренажёр', 'Трицепс', 'Разгибание рук в тренажёре на трицепс', NULL),
                    (-1414, 'Гантель', 'Трицепс', 'Разгибание руки с гантелью в наклоне', NULL),
                    (-1413, 'Блочный тренажёр', 'Трицепс', 'Разгибание рук на блоке из-за головы', NULL),
                    (-1412, 'Блочный тренажёр', 'Трицепс', 'Разгибание одной руки на верхнем блоке', NULL),
                    (-1411, 'Блочный тренажёр', 'Трицепс', 'Разгибание рук на верхнем блоке обратным хватом', NULL),
                    (-1410, 'Блочный тренажёр', 'Трицепс', 'Разгибание рук на верхнем блоке с прямой рукоятью', NULL),
                    (-1409, 'Блочный тренажёр', 'Трицепс', 'Разгибание рук на верхнем блоке с канатом', NULL),
                    (-1408, 'EZ-гриф', 'Трицепс', 'Разгибание рук с EZ-грифом из-за головы', NULL),
                    (-1407, 'Гантель', 'Трицепс', 'Разгибание рук с гантелью из-за головы', NULL),
                    (-1406, 'Гантель, скамья', 'Трицепс', 'Французский жим гантели одной рукой сидя', NULL),
                    (-1405, 'Гантели, скамья', 'Трицепс', 'Французский жим гантелей лёжа', NULL),
                    (-1404, 'EZ-гриф, скамья', 'Трицепс', 'Французский жим EZ-грифа лёжа', NULL),
                    (-1403, 'Штанга, скамья', 'Трицепс', 'Французский жим штанги лёжа', NULL),
                    (-1402, 'Без оборудования', 'Трицепс', 'Алмазные отжимания', NULL),
                    (-1401, 'Скамья', 'Трицепс', 'Обратные отжимания от скамьи', NULL),
                    (-1400, 'Брусья', 'Трицепс', 'Отжимания на брусьях с акцентом на трицепс', NULL),
                    (-1317, 'Гиря', 'Бицепс', 'Сгибание рук с гирей', NULL),
                    (-1316, 'Эспандер', 'Бицепс', 'Сгибание рук с эспандером', NULL),
                    (-1315, 'Штанга', 'Бицепс', 'Обратное сгибание рук со штангой', NULL),
                    (-1314, 'Кроссовер', 'Бицепс', 'Сгибание руки на блоке за корпусом', NULL),
                    (-1313, 'Кроссовер', 'Бицепс', 'Сгибание рук в кроссовере сверху', NULL),
                    (-1312, 'Блочный тренажёр', 'Бицепс', 'Сгибание рук с канатом на нижнем блоке', NULL),
                    (-1311, 'Блочный тренажёр', 'Бицепс', 'Сгибание рук на нижнем блоке', NULL),
                    (-1310, 'Тренажёр', 'Бицепс', 'Сгибание рук в тренажёре на бицепс', NULL),
                    (-1309, 'Гантель, скамья Скотта', 'Бицепс', 'Сгибание одной руки на скамье Скотта', NULL),
                    (-1308, 'EZ-гриф, скамья Скотта', 'Бицепс', 'Сгибание рук на скамье Скотта с EZ-грифом', NULL),
                    (-1307, 'Гантель', 'Бицепс', 'Концентрированное сгибание руки', NULL),
                    (-1306, 'Гантели, скамья', 'Бицепс', 'Сгибание рук с гантелями на наклонной скамье', NULL),
                    (-1305, 'Гантели', 'Бицепс', 'Перекрёстные молотковые сгибания', NULL),
                    (-1304, 'Гантели', 'Бицепс', 'Молотковые сгибания рук', NULL),
                    (-1303, 'Гантели', 'Бицепс', 'Попеременное сгибание рук с супинацией', NULL),
                    (-1302, 'Гантели', 'Бицепс', 'Сгибание рук с гантелями стоя', NULL),
                    (-1301, 'EZ-гриф', 'Бицепс', 'Сгибание рук с EZ-грифом стоя', NULL),
                    (-1300, 'Штанга', 'Бицепс', 'Сгибание рук со штангой стоя', NULL),
                    (-1223, 'Стена', 'Плечи', 'Отжимания в стойке на руках', NULL),
                    (-1222, 'Без оборудования', 'Плечи', 'Пайк-отжимания', NULL),
                    (-1221, 'Гантели', 'Плечи', 'Тяга гантелей к подбородку', NULL),
                    (-1220, 'Штанга', 'Плечи', 'Тяга штанги к подбородку', NULL),
                    (-1219, 'Блочный тренажёр', 'Плечи', 'Тяга каната к лицу', NULL),
                    (-1218, 'Кроссовер', 'Плечи', 'Разведение рук в кроссовере на заднюю дельту', NULL),
                    (-1217, 'Тренажёр', 'Плечи', 'Обратная бабочка', NULL),
                    (-1216, 'Гантели, скамья', 'Плечи', 'Разведение гантелей лёжа лицом вниз', NULL),
                    (-1215, 'Гантели', 'Плечи', 'Разведение гантелей в наклоне', NULL),
                    (-1214, 'Кроссовер', 'Плечи', 'Подъём руки перед собой на нижнем блоке', NULL),
                    (-1213, 'Блин', 'Плечи', 'Подъём блина перед собой', NULL),
                    (-1212, 'Гантели', 'Плечи', 'Подъём гантелей перед собой', NULL),
                    (-1211, 'Кроссовер', 'Плечи', 'Подъём руки в сторону на нижнем блоке', NULL),
                    (-1210, 'Гантель', 'Плечи', 'Подъём гантели в сторону одной рукой', NULL),
                    (-1209, 'Гантели, скамья', 'Плечи', 'Разведение гантелей в стороны сидя', NULL),
                    (-1208, 'Гантели', 'Плечи', 'Разведение гантелей в стороны стоя', NULL),
                    (-1207, 'Тренажёр', 'Плечи', 'Жим в тренажёре на плечи', NULL),
                    (-1206, 'Штанга, лэндмайн', 'Плечи', 'Жим одной рукой в лэндмайне', NULL),
                    (-1205, 'Гиря', 'Плечи', 'Жим гири одной рукой стоя', NULL),
                    (-1204, 'Гантели', 'Плечи', 'Жим Арнольда', NULL),
                    (-1203, 'Штанга, скамья', 'Плечи', 'Жим штанги из-за головы сидя', NULL),
                    (-1202, 'Штанга, скамья', 'Плечи', 'Жим штанги сидя', NULL),
                    (-1201, 'Гантели', 'Плечи', 'Жим гантелей стоя', NULL),
                    (-1200, 'Гантели, скамья', 'Плечи', 'Жим гантелей сидя', NULL),
                    (-1127, 'Гиря', 'Спина', 'Тяга гири к поясу одной рукой', NULL),
                    (-1126, 'Эспандер', 'Спина', 'Тяга эспандера к поясу сидя', NULL),
                    (-1125, 'Низкая перекладина', 'Спина', 'Австралийские подтягивания', NULL),
                    (-1124, 'Тренажёр', 'Спина', 'Пуловер в тренажёре', NULL),
                    (-1123, 'Блочный тренажёр', 'Спина', 'Пуловер на верхнем блоке прямыми руками', NULL),
                    (-1122, 'Рычажный тренажёр', 'Спина', 'Тяга в рычажном тренажёре одной рукой', NULL),
                    (-1121, 'Тренажёр', 'Спина', 'Тяга в тренажёре с упором грудью', NULL),
                    (-1120, 'Тренажёр Смита', 'Спина', 'Тяга штанги к поясу в Смите', NULL),
                    (-1119, 'Штанга', 'Спина', 'Тяга Пендлея', NULL),
                    (-1118, 'Штанга', 'Спина', 'Тяга штанги обратным хватом в наклоне', NULL),
                    (-1117, 'Т-гриф, тренажёр', 'Спина', 'Тяга Т-грифа с упором грудью', NULL),
                    (-1116, 'Т-гриф', 'Спина', 'Тяга Т-грифа', NULL),
                    (-1115, 'Гантели, скамья', 'Спина', 'Тяга гантелей лёжа на наклонной скамье', NULL),
                    (-1114, 'Гантели', 'Спина', 'Тяга двух гантелей в наклоне', NULL),
                    (-1113, 'Гантель, скамья', 'Спина', 'Тяга гантели в наклоне одной рукой', NULL),
                    (-1112, 'Блочный тренажёр', 'Спина', 'Тяга горизонтального блока одной рукой', NULL),
                    (-1111, 'Блочный тренажёр', 'Спина', 'Тяга горизонтального блока широким хватом', NULL),
                    (-1110, 'Блочный тренажёр', 'Спина', 'Тяга горизонтального блока узким хватом', NULL),
                    (-1109, 'Блочный тренажёр', 'Спина', 'Тяга верхнего блока одной рукой', NULL),
                    (-1108, 'Блочный тренажёр', 'Спина', 'Тяга верхнего блока нейтральным хватом', NULL),
                    (-1107, 'Блочный тренажёр', 'Спина', 'Тяга верхнего блока обратным хватом', NULL),
                    (-1106, 'Блочный тренажёр', 'Спина', 'Тяга верхнего блока к груди', NULL),
                    (-1105, 'Гравитрон', 'Спина', 'Подтягивания в гравитроне', NULL),
                    (-1104, 'Турник, резиновая петля', 'Спина', 'Подтягивания с резиновой петлёй', NULL),
                    (-1103, 'Турник, пояс с отягощением', 'Спина', 'Подтягивания с отягощением', NULL),
                    (-1102, 'Турник', 'Спина', 'Подтягивания широким хватом', NULL),
                    (-1101, 'Турник', 'Спина', 'Подтягивания нейтральным хватом', NULL),
                    (-1100, 'Турник', 'Спина', 'Подтягивания обратным хватом', NULL),
                    (-1025, 'Кроссовер', 'Грудь', 'Жим одной рукой в кроссовере', NULL),
                    (-1024, 'Брусья', 'Грудь', 'Отжимания на брусьях с акцентом на грудь', NULL),
                    (-1023, 'Эспандер', 'Грудь', 'Отжимания с эспандером', NULL),
                    (-1022, 'Опора', 'Грудь', 'Отжимания с руками на возвышении', NULL),
                    (-1021, 'Опора', 'Грудь', 'Отжимания с ногами на возвышении', NULL),
                    (-1020, 'Без оборудования', 'Грудь', 'Отжимания от пола широким хватом', NULL),
                    (-1019, 'Без оборудования', 'Грудь', 'Отжимания от пола', NULL),
                    (-1018, 'Гантель, скамья', 'Грудь', 'Пуловер с гантелью лёжа', NULL),
                    (-1017, 'Гантели, скамья', 'Грудь', 'Разведение гантелей на наклонной скамье', NULL),
                    (-1016, 'Гантели, скамья', 'Грудь', 'Разведение гантелей лёжа', NULL),
                    (-1015, 'Тренажёр', 'Грудь', 'Сведение рук в тренажёре бабочка', NULL),
                    (-1014, 'Кроссовер', 'Грудь', 'Сведение рук в кроссовере на уровне груди', NULL),
                    (-1013, 'Кроссовер', 'Грудь', 'Сведение рук в кроссовере снизу', NULL),
                    (-1012, 'Кроссовер', 'Грудь', 'Сведение рук в кроссовере сверху', NULL),
                    (-1011, 'Штанга', 'Грудь', 'Жим штанги на полу', NULL),
                    (-1010, 'Гантели', 'Грудь', 'Жим гантелей на полу', NULL),
                    (-1009, 'Тренажёр Смита, скамья', 'Грудь', 'Жим в Смите на наклонной скамье', NULL),
                    (-1008, 'Тренажёр Смита, скамья', 'Грудь', 'Жим в Смите лёжа', NULL),
                    (-1007, 'Тренажёр', 'Грудь', 'Жим в тренажёре на верх груди', NULL),
                    (-1006, 'Тренажёр', 'Грудь', 'Жим в тренажёре сидя', NULL),
                    (-1005, 'Штанга, скамья', 'Грудь', 'Жим штанги узким хватом лёжа', NULL),
                    (-1004, 'Гантели, скамья', 'Грудь', 'Жим гантелей на скамье с отрицательным наклоном', NULL),
                    (-1003, 'Штанга, скамья', 'Грудь', 'Жим штанги на скамье с отрицательным наклоном', NULL),
                    (-1002, 'Штанга, скамья', 'Грудь', 'Жим штанги на наклонной скамье', NULL),
                    (-1001, 'Гантели, скамья', 'Грудь', 'Жим гантелей на наклонной скамье', NULL),
                    (-1000, 'Гантели, скамья', 'Грудь', 'Жим гантелей лёжа', NULL)
                ON CONFLICT DO NOTHING;
                """);
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2913);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2912);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2911);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2910);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2909);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2908);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2907);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2906);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2905);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2904);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2903);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2902);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2901);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2900);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2817);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2816);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2815);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2814);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2813);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2812);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2811);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2810);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2809);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2808);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2807);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2806);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2805);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2804);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2803);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2802);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2801);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2800);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2704);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2703);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2702);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2701);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2700);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2611);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2610);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2609);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2608);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2607);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2606);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2605);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2604);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2603);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2602);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2601);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2600);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2506);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2505);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2504);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2503);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2502);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2501);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2500);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2406);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2405);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2404);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2403);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2402);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2401);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2400);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2307);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2306);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2305);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2304);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2303);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2302);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2301);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2300);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2207);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2206);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2205);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2204);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2203);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2202);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2201);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2200);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2111);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2110);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2109);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2108);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2107);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2106);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2105);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2104);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2103);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2102);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2101);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2100);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2017);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2016);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2015);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2014);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2013);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2012);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2011);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2010);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2009);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2008);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2007);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2006);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2005);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2004);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2003);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2002);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2001);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -2000);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1909);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1908);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1907);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1906);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1905);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1904);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1903);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1902);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1901);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1900);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1817);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1816);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1815);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1814);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1813);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1812);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1811);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1810);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1809);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1808);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1807);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1806);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1805);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1804);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1803);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1802);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1801);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1800);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1714);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1713);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1712);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1711);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1710);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1709);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1708);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1707);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1706);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1705);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1704);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1703);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1702);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1701);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1700);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1623);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1622);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1621);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1620);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1619);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1618);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1617);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1616);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1615);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1614);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1613);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1612);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1611);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1610);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1609);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1608);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1607);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1606);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1605);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1604);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1603);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1602);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1601);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1600);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1511);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1510);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1509);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1508);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1507);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1506);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1505);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1504);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1503);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1502);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1501);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1500);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1417);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1416);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1415);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1414);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1413);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1412);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1411);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1410);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1409);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1408);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1407);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1406);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1405);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1404);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1403);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1402);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1401);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1400);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1317);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1316);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1315);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1314);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1313);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1312);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1311);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1310);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1309);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1308);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1307);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1306);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1305);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1304);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1303);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1302);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1301);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1300);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1223);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1222);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1221);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1220);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1219);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1218);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1217);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1216);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1215);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1214);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1213);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1212);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1211);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1210);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1209);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1208);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1207);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1206);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1205);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1204);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1203);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1202);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1201);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1200);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1127);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1126);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1125);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1124);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1123);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1122);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1121);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1120);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1119);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1118);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1117);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1116);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1115);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1114);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1113);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1112);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1111);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1110);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1109);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1108);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1107);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1106);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1105);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1104);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1103);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1102);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1101);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1100);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1025);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1024);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1023);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1022);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1021);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1020);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1019);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1018);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1017);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1016);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1015);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1014);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1013);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1012);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1011);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1010);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1009);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1008);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1007);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1006);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1005);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1004);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1003);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1002);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1001);

            migrationBuilder.DeleteData(
                table: "Exercises",
                keyColumn: "Id",
                keyValue: -1000);
        }
    }
}
